Revit 2027 API
HandRailType.SupportJustification Property
 The support justification method of the handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RailSupportJustification SupportJustification { get; set; }
Public Property SupportJustification As RailSupportJustification
	Get
	Set
public:
property RailSupportJustification SupportJustification {
	RailSupportJustification get ();
	void set (RailSupportJustification value);
}
member SupportJustification : RailSupportJustification with get, set
Property Value
RailSupportJustification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The rail has no support or the support layout is not fixed distance so the data being set is not applicable.
See Also
Reference
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace